In [3]:
import pandas as pd
import matplotlib as plt
import numpy as np

In [4]:
ld_county = pd.read_csv('data/LD_Case_Counts_by_County_2022.csv')
ld_county.columns

Index(['Ctyname', 'stname', 'ststatus', 'stcode', 'ctycode', 'Cases2001',
       'Cases2002', 'Cases2003', 'Cases2004', 'Cases2005', 'Cases2006',
       'Cases2007', 'Cases2008', 'Cases2009', 'Cases2010', 'Cases2011',
       'Cases2012', 'Cases2013', 'Cases2014', 'Cases2015', 'Cases2016',
       'Cases2017', 'Cases2018', 'Cases2019', 'Cases2020', 'cases2021',
       'cases2022'],
      dtype='object')

In [5]:
ny_cases = ld_county.loc[ld_county['stname'] == 'New York']
ny_cases.shape

(62, 27)

There are 62 recorded outbreaks of legionella in New York.

In [7]:
nyc_rates = pd.read_csv('data/NYC.csv')
nyc_rates

    NTA code                           NTA name  rate
0       BK25                          Homecrest  0.00
1       BK46                Ocean Parkway South  0.00
2       BK29                   Bensonhurst East  0.27
3       BK44                            Madison  0.36
4       BK19                     Brighton Beach  0.50
..       ...                                ...   ...
184     SI35           New Brighton-Silver Lake  3.71
185     SI36  Old Town-Dongan Hills-South Beach  3.81
186     SI48                      Arden Heights  4.35
187     SI25              Oakwood-Oakwood Beach  4.36
188     SI37                 Stapleton-Rosebank  5.30

[189 rows x 3 columns]